<?php

namespace Database\Seeders;

use App\Models\City;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CitySeeder extends Seeder
{
    public function run(): void
    {
        $cities = [
            ['name' => 'Город Астана', 'code' => '01',],
            ['name' => 'Город Алматы', 'code' => '02',],
            ['name' => 'Город Шымкент', 'code' => '03',],
            ['name' => 'Абайская область', 'code' => '04',],
            ['name' => 'Акмолинская область', 'code' => '05',],
            ['name' => 'Актюбинская область', 'code' => '06',],
            ['name' => 'Алматинская область', 'code' => '07',],
            ['name' => 'Атырауская область', 'code' => '08',],
            ['name' => 'Восточно-Казахстанская область', 'code' => '09',],
            ['name' => 'Жамбылская область', 'code' => '10',],
            ['name' => 'Жетысуская область', 'code' => '11',],
            ['name' => 'Западно-Казахстанская область', 'code' => '12',],
            ['name' => 'Карагандинская область', 'code' => '13',],
            ['name' => 'Костанайская область', 'code' => '14',],
            ['name' => 'Кызылординская область', 'code' => '15',],
            ['name' => 'Мангистауская область', 'code' => '16',],
            ['name' => 'Павлодарская область', 'code' => '17',],
            ['name' => 'Северо-Казахстанская область', 'code' => '18',],
            ['name' => 'Туркестанская область', 'code' => '19',],
            ['name' => 'Улытауская область', 'code' => '20',],
        ];

        City::query()->insert($cities);

        $cities = [
            ['name' => 'Аккольский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Аршалынский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Астраханский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Атбасарский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Буландынский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Бурабайский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Егиндыкольский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Ерейментауский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Есильский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Жаксынский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Жаркаинский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Зерендинский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Кокшетау городской акимат', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Коргалжынский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'район Биржан сал', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Сандыктауский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Степногорск городской акимат', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Целиноградский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'Шортандинский район', 'code' => rand(100,999), 'city_id' => 5],
            ['name' => 'село Азат', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'село Енбек', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'село Жалгызкарагай', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'аул Кына', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'аул Домбыралы', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'село Наумовка', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'село Новорыбинка', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'село Урюпинка', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'село Минское', 'code' => rand(100, 999), 'city_id' => 21],
            ['name' => 'село Кырыккудык', 'code' => rand(100, 999), 'city_id' => 21],
        ];

        City::query()->insert($cities);
    }
}
